In [5]:
!python -V

Python 3.9.16

#### pandas

In [6]:
"""
 - 행과 열로 되어 있는 데이터를 컨트롤 할때 사용되는 라이브러리
 - 행단위 데이터 취합 또는 열단위 데이터 취합시 사용
 - 데이터 필터링(검색) 시 사용
 - 라이브러리 설치를 통해 사용할수 있음
 - 주로 Database, File기반의 엑셀 csv json 등의 데이터 전처리에 사용됨
"""

'\n - 행과 열로 되어 있는 데이터를 컨트롤 할때 사용되는 라이브러리\n - 행단위 데이터 취합 또는 열단위 데이터 취합시 사용\n - 데이터 필터링(검색) 시 사용\n - 라이브러리 설치를 통해 사용할수 있음\n - 주로 Database, File기반의 엑셀 csv json 등의 데이터 전처리에 사용됨\n'

#### 1.데이터 불러오기

In [7]:
### 라이브러리 불러들이기
import pandas as pd

In [8]:
# 1.파일 읽기
# pandas에ㅔ서 외부파일을 읽어 들일때 read_xxx()
# - usecols : 사용할 항목
# - skipfooter : 마지막 행 제거

sample_1 = pd.read_excel('./01_판다스기본/files/sample_1.xlsx', header=1,skipfooter=2, usecols="a:c")

In [9]:
sample_1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    6 non-null      object
 1   성별      6 non-null      object
 2   입국객수    6 non-null      int64
dtypes: int64(1), object(2)
memory usage: 272.0+ bytes

In [10]:
sample_1.head()

  국적코드  성별    입국객수
0  A01  남성  106320
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912

In [11]:
sample_1.tail()

  국적코드  성별    입국객수
1  A01  여성  191436
2  A31  남성     319
3  A31  여성      42
4  A18  남성  158912
5  A18  여성  232943

In [12]:
# 기초 통계함수
# - 데이터프레임 컬럼 중에 숫자에 대한 통계값 제공
sample_1.describe()

                입국객수
count       6.000000
mean   114995.333333
std     98105.752006
min        42.000000
25%     26819.250000
50%    132616.000000
75%    183305.000000
max    232943.000000

In [13]:
# 리스트 기호 1개만 사용한 경우 시리즈타입으로 추출
sample_1['입국객수']

0    106320
1    191436
2       319
3        42
4    158912
5    232943
Name: 입국객수, dtype: int64

In [14]:
# 리스트 기호 2개를 사용한 경우 행렬형태로 추출
sample_1[['입국객수','성별']]

     입국객수  성별
0  106320  남성
1  191436  여성
2     319  남성
3      42  여성
4  158912  남성
5  232943  여성

### 열단위 값 추가

In [15]:
# 항목 추가
# 딕셔너리(키:값)에 값을 추가할때와 동일 
sample_1['기준년월'] = '2019-11'

In [16]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

### 행단위 값 변경

In [17]:
# 행조건을 입력해서 값 변경
# - 조건처리를 분석에서는 "필터링"이라 칭함
"""
<조건 연산자 사용>
>,<, >=, <=, ==, !!=
"""

# 성별 데이터 중에 남성 인 데이터만 추출

cond = sample_1['성별'] == "남성"

In [18]:
# - 조건이 참인 경우만 추출
sample_1[cond]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [19]:
# - 조건이 참/거짓인 경우만 추출
sample_1[cond == False]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
3  A31  여성      42  2019-11
5  A18  여성  232943  2019-11

In [20]:
# 필터링 변수없이 바로 사용
sample_1[(sample_1['성별']=="남성")]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
2  A31  남성     319  2019-11
4  A18  남성  158912  2019-11

In [21]:
sample_1[(sample_1['성별']=='남성')]['국적코드']

0    A01
2    A31
4    A18
Name: 국적코드, dtype: object

In [22]:
# 입국객수가 150000이상인 경우 추출

sample_1[(sample_1['입국객수'] > 150000)]

  국적코드  성별    입국객수     기준년월
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [23]:
# 조건값에 대한 특정열 추출
sample_1[(sample_1['입국객수'] > 150000)][['국적코드','성별']]

  국적코드  성별
1  A01  여성
4  A18  남성
5  A18  여성

In [24]:
# 논리연산자  &, |
sample_1[(sample_1['입국객수']>150000)&(sample_1['성별']=='남성')]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [25]:
cond1 = sample_1['성별'] == "남성"
cond2 = sample_1['입국객수'] > 150000

In [26]:
sample_1[cond1 & cond2]

  국적코드  성별    입국객수     기준년월
4  A18  남성  158912  2019-11

In [27]:
# 국적코드가 A01 또는 A18인 데이터
sample_1[(sample_1['국적코드'] =='A01') | (sample_1['국적코드']=='A18')]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [28]:
cond1 = sample_1['국적코드'] == 'A01'
cond2 = sample_1['국적코드'] == 'A18'

sample_1[cond1 | cond2]

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

#### sample['항목'].isin([값1,값2])

In [29]:
# 또는 조건을 편리하게 사용할수 있는 isin 함수
cond = sample_1['국적코드'].isin (['A01','A18'])
sample_1[cond][['국적코드','성별']]

  국적코드  성별
0  A01  남성
1  A01  여성
4  A18  남성
5  A18  여성

#### 데이터 통합하기
#### - 컬람단위로 옆으로 통합하기

In [30]:
sample_1

  국적코드  성별    입국객수     기준년월
0  A01  남성  106320  2019-11
1  A01  여성  191436  2019-11
2  A31  남성     319  2019-11
3  A31  여성      42  2019-11
4  A18  남성  158912  2019-11
5  A18  여성  232943  2019-11

In [31]:
code_master = pd.read_excel('./01_판다스기본/files/sample_codemaster.xlsx')

In [32]:
code_master

  국적코드     국적명
0  A01      일본
1  A02      대만
2  A03      홍콩
3  A18      중국
4  A19      이란
5  A22  우즈베키스탄
6  A23   카자흐스탄
7  A99  아시아 기타

In [36]:
code_master.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   국적코드    8 non-null      object
 1   국적명     8 non-null      object
dtypes: object(2)
memory usage: 256.0+ bytes

In [47]:
# merge : 다른 데이터의 컬럼값 가지고 오기
# 두개의 데이터에서 특정 컬럼명의 데이터값이 같은 것에 대해 merge(합) 하기
# merge함수는 컬럼 단위로 오른쪽으로 열을 추가
# how : inner, left, right, outer
sample_1_code = pd.merge(left = sample_1, 
                          right = code_master,
                          how = "left", # left, right, outer, inner
                          left_on ='국적코드',
                          right_on = '국적코드')

In [48]:
sample_1_code

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국

#### 아래로 행 추가하기

In [52]:
sample_2 = pd.read_excel('./01_판다스기본/files/sample_2.xlsx', header=1,skipfooter=2, usecols='a:c')

In [57]:
sample_2['기준년월'] = '2019-12'
sample_2

  국적코드  성별    입국객수     기준년월
0  A01  남성   92556  2019-12
1  A01  여성  163737  2019-12
2  A18  남성  155540  2019-12
3  A18  여성  249023  2019-12

In [59]:
sample_2 = pd.merge(left= sample_2, 
                    right=code_master,
                    how='left',
                    left_on = '국적코드',
                    right_on='국적코드')
sample_2

  국적코드  성별    입국객수     기준년월 국적명
0  A01  남성   92556  2019-12  일본
1  A01  여성  163737  2019-12  일본
2  A18  남성  155540  2019-12  중국
3  A18  여성  249023  2019-12  중국

In [63]:
# concat : 행단위로 데이터 합치기 : 컬럼의 갯수가 같아야 함
# - concat([data1, data2,...])
# - append(data1, data2,...)  옛날 방식으로 권장하지 않음
# - 인덱스 재설정 : ignore_index = True

sample_1_code.append(sample_2, ignore_index =True)

C:\Users\세종tp\AppData\Local\Temp\ipykernel_12732\2297759032.py:6: FutureWarning: The frame.append method is deprecated and will be removed from pandas in a future version. Use pandas.concat instead.
  sample_1_code.append(sample_2, ignore_index =True)

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [71]:
# - 인덱스 재설정 : ignore_index = True
sample = pd.concat([sample_1_code, sample_2],
                   ignore_index=True)

sample

  국적코드  성별    입국객수     기준년월  국적명
0  A01  남성  106320  2019-11   일본
1  A01  여성  191436  2019-11   일본
2  A31  남성     319  2019-11  NaN
3  A31  여성      42  2019-11  NaN
4  A18  남성  158912  2019-11   중국
5  A18  여성  232943  2019-11   중국
6  A01  남성   92556  2019-12   일본
7  A01  여성  163737  2019-12   일본
8  A18  남성  155540  2019-12   중국
9  A18  여성  249023  2019-12   중국

In [67]:
"""
1. 데이터 불러오기
2. 기준년월 컬럼 추가하기
3. 국적명 컬럼 추가
4. 행단위로 데이터  합치기
"""

'\n1. 데이터 불러오기\n2. 기준년월 컬럼 추가하기\n3. 국적명 컬럼 추가\n4. 행단위로 데이터  합치기\n'

#### 데이터 저장하기

#### 함수 사용법 shift+tab : 함수앞에 커서를 두고 shift+tab

In [81]:
# index=False : index는 제거하고 저장
#
sample.to_excel('./01_판다스기본/files/sample.xlsx', index = False, sheet_name='A01')

In [82]:
?to_excel()

Object `to_excel()` not found.